export const OBJECT_LEVELS_DATA = [
  {
    id: 1,
    title: 'Промышленные объекты',
    prev: 'заводы, производственные цеха, логистические и складские комплексы.',
  },
  {
    id: 2,
    title: 'Государственные учреждения',
    prev: 'акиматы, государственные департаменты, ЦОН.',
  },
  {
    id: 3,
    title: 'Социальные объекты',
    prev: 'школы, детские сады, больницы.',
  },
  {
    id: 4,
    title: 'Стратегические объекты',
    prev: 'ТЭЦ и электростанции, дата-центры, объекты связи и обороны.',
  },
  {
    id: 5,
    title: 'Жилые объекты',
    prev: ' жилые комплексы, частные дома, коттеджи.',
  },
  {
    id: 6,
    title: 'Административные учреждения',
    prev: 'бизнес-центры, банки, корпоративные офисы.',
  },
];
