export const OBJECT_LEVELS_DATA = [
  {
    id: 1,
    title: 'Промышленные объекты',
    prev: 'Металлургические и химические заводы, производственные цеха.',
  },
  {
    id: 2,
    title: 'Государственные учреждения',
    prev: 'Металлургические и химические заводы, производственные цеха.',
  },
  {
    id: 3,
    title: 'Социальные объекты',
    prev: 'Металлургические и химические заводы, производственные цеха.',
  },
  {
    id: 4,
    title: 'Стратегические объекты',
    prev: 'Металлургические и химические заводы, производственные цеха.',
  },
  {
    id: 5,
    title: 'Жилые объекты',
    prev: 'Металлургические и химические заводы, производственные цеха.',
  },
  {
    id: 6,
    title: 'Административные учреждения',
    prev: 'Металлургические и химические заводы, производственные цеха.',
  },
];
