import type { ProjectMenuData } from './projectMenu.types';

export const PROJECT_MENU_DATA: ProjectMenuData[] = [
  {
    id: 1,
    title: 'Филиал «Назарбаев Интеллектуальная школа» г. Тараз, АОО «НИШ»',
    service: 'Система видеонаблюдения',
    subtitle: 'Реализовали техническое обслуживание системы видеонаблюдения.',
    image: '/img/favorite-1.webp',
  },
  {
    id: 2,
    title: 'КГУ «Аппарат акима Жамбылской области»',
    subtitle:
      'Реализовали установку системы видеонаблюдения в резиденции акима Жамбылской области.',
    service: 'Система видеонаблюдения',
    image: '/img/favorite-2.webp',
  },
  {
    id: 3,
    title: 'ЖОФ АО «Казпочта»',
    subtitle:
      'Реализовали установку охранной сигнализации, домофонов, системы контроля доступа и тревожной сигнализации.',
    service: 'Комплексная безопасность',
    image: '/img/favorite-3.webp',
  },
  {
    id: 4,
    title: 'ТОО «Фиркан»',
    subtitle: 'Реализовали монтаж системы пожарной сигнализации.',
    service: 'Пожарная сигнализация',
    image: '/img/product-item-1.webp',
  },
  {
    id: 5,
    title: 'ТОО «Научно-клинический центр кардиохирургии и трансплантации»',
    subtitle: 'Реализовали поставку оборудования системы безопасности для медицинского учреждения.',
    service: 'Система видеонаблюдения',
    image: '/img/product-item-2.webp',
  },
  {
    id: 6,
    title: 'КГП «Тараз-Арена»',
    subtitle: 'Реализовали техническое обслуживание системы видеонаблюдения.',
    service: 'Система видеонаблюдения',
    image: '/img/product-item-3.webp',
  },
  {
    id: 7,
    title: 'ГУ «Департамент КНБ РК по Жамбылской области»',
    subtitle:
      'Реализовали техническое обслуживание систем охранно-пожарной сигнализации и видеонаблюдения.',
    service: 'Охранно-пожарная система',
    image: '/img/product-item-4.webp',
  },
  {
    id: 8,
    title: 'НАО «КазНИТУ им. К.И. Сатпаева»',
    subtitle:
      'Реализовали ремонт и модернизацию пожарной и охранной сигнализации, а также систем тушения.',
    service: 'Охранно-пожарная система',
    image: '/img/product-item-5.webp',
  },
  {
    id: 9,
    title: 'АО «Казахский агротехнический университет им. С. Сейфуллина»',
    subtitle: 'Реализовали установку системы видеонаблюдения во всех корпусах университета.',
    service: 'Система видеонаблюдения',
    image: '',
  },
  {
    id: 10,
    title: 'АО «Университет КИМЭП»',
    subtitle:
      'Реализовали установку системы видеонаблюдения, контроля доступа и охранной сигнализации.',
    service: 'Комплексная система безопасности',
    image: '',
  },
  {
    id: 11,
    title: 'РГУ «Казахская национальная академия искусств им. Т.К. Жургенова»',
    subtitle: 'Реализовали установку системы пожарной сигнализации.',
    service: 'Охранно-пожарная система',
    image: '',
  },
  {
    id: 12,
    title: 'РГУ «Национальный архив Республики Казахстан»',
    subtitle: 'Реализовали установку адресной пожарной сигнализации.',
    service: 'Охранно-пожарная система',
    image: '',
  },
  {
    id: 13,
    title: 'ГУ «Служба пожаротушения и аварийно-спасательных работ» ДЧС г. Алматы',
    subtitle: 'Реализовали установку системы видеонаблюдения.',
    service: 'Система видеонаблюдения',
    image: '',
  },
  {
    id: 14,
    title: 'РГУ «Казахская национальная консерватория им. Курмангазы»',
    subtitle: 'Реализовали монтаж пропускной системы-турникетов в общежитии.',
    service: 'Система контроля доступа',
    image: '',
  },
  {
    id: 15,
    title: 'КГУ «Управление культуры города Алматы»',
    subtitle: 'Реализовали монтаж охранной сигнализации и системы видеонаблюдения.',
    service: 'Охранно-пожарная система и система видеонаблюдения',
    image: '',
  },
  {
    id: 16,
    title: 'ДБ АО «Банк Хоум Кредит»',
    subtitle:
      'Реализовали монтаж охранной сигнализации, системы видеонаблюдения, пожарной сигнализации, контроля доступа и газового пожаротушения в отделении г. Тараз.',
    service: 'Комплексная система безопасности',
    image: '',
  },
  {
    id: 17,
    title: 'ГУ «Министерство иностранных дел Республики Казахстан»',
    subtitle: 'Реализовали текущий ремонт системы пожарной сигнализации здания ДКС МИД РК.',
    service: 'Охранно-пожарная система',
    image: '',
  },
  {
    id: 18,
    title: 'НАО «Евразийский национальный университет им. Л.Н. Гумилева»',
    subtitle:
      'Реализовали замену автоматической пожарной сигнализации в учебно-административном корпусе.',
    service: 'Охранно-пожарная система',
    image: '',
  },
  {
    id: 19,
    title: 'АО «Агентство "Хабар"»',
    subtitle:
      'Реализовали монтаж системы пожарной сигнализации с заменой и установкой оборудования.',
    service: 'Охранно-пожарная система',
    image: '',
  },
  {
    id: 20,
    title: 'НАО «КазНУ им. Аль-Фараби»',
    subtitle: 'Реализовали установку системы оповещения',
    service: 'Система оповещения',
    image: '',
  },
  {
    id: 21,
    title: 'ГУ «Министерство энергетики Республики Казахстан»',
    subtitle: 'Реализовали монтаж комплексной системы безопасности.',
    service: 'Комплексная система безопасности',
    image: '',
  },
  {
    id: 22,
    title: 'АО «Отбасы Банк»',
    subtitle: 'Реализовали поставку прибора речевого оповещения.',
    service: 'Система оповещения',
    image: '',
  },
  {
    id: 23,
    title: 'НАО «Таразский региональный университет им. М.Х. Дулати»',
    subtitle: 'Реализовали установку охранной сигнализации и системы видеонаблюдения.',
    service: 'Охранно-пожарная система и система видеонаблюдения',
    image: '',
  },
  {
    id: 24,
    title: 'РГУ «Министерство финансов Республики Казахстан»',
    subtitle:
      'Реализовали прокладку структурированной кабельной сети в УГД и ДГД различных регионов.',
    service: 'Комплексная система безопасности',
    image: '',
  },
  {
    id: 25,
    title: 'НАО «Актюбинский региональный университет им. К. Жубанова»',
    subtitle: 'Реализовали установку системы видеонаблюдения.',
    service: 'Система видеонаблюдения',
    image: '',
  },
  {
    id: 26,
    title: 'ГУ «Департамент полиции Кызылординской области» МВД РК',
    subtitle: 'Реализовали приобретение и установку камер видеонаблюдения для служебных помещений.',
    service: 'Система видеонаблюдения',
    image: '',
  },
  {
    id: 27,
    title: 'ТОО «Qazaq Stroy Almaty»',
    subtitle: 'Реализовали поставку оборудования комплекса систем безопасности.',
    service: 'Комплексная система безопасности',
    image: '',
  },
] as const;

export const INITIAL_ITEMS_COUNT = 8;
