import './ntouch.scss';
export const Ntouch = () => {
  return (
    <section className="ntouch">
      <div className="ntouch__container container">
        <h1>
          ТОО «Новые технологии – Тараз» проводит теоретические и практические курсы, посвященные
          работе с оборудованием торговой марки NTOUCH
        </h1>
        <p>
          Занятия проводят сертифицированные специалисты, обучение проходит по утверждённым
          программам не реже одного раза в квартал. Мы обеспечиваем слушателей методическими
          материалами, практическими кейсами и доступом к современному оборудованию.
        </p>
      </div>
    </section>
  );
};
