export const SLIDER_DATA = {
  1: {
    title: 'Системы защиты',
    slides: [
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Система видеонаблюдения',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Контроль доступа',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Пожарная сигнализация',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Охранная сигнализация',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
    ],
  },
  2: {
    title: 'IT-решения',
    slides: [
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Веб-разработка',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Мобильные приложения',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Облачные решения',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Кибербезопасность',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
    ],
  },
  3: {
    title: 'Обучение',
    slides: [
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Курсы по безопасности',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'IT-тренинги',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Сертификация',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
      {
        src: '/img/slider-services-1m.webp',
        heading: 'Практические занятия',
        alt: 'Датчики дыма, движения, звуковая и световая сигнализация, панели управления',
      },
    ],
  },
};